docs/2016/netsh-reset-command-is-not-found.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="ja" xml:lang="ja">
<head>
<!-- 2020-09-17 Thu 12:20 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>netsh -f で reset がみつからない</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="clothoid" />
<meta name="keywords" content="netsh reset command error powershell commandprompt cmd" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="https://clothoid.github.io/sitemap.html"> UP </a>
 |
 <a accesskey="H" href="https://clothoid.github.io/"> HOME </a>
</div><div id="content">
<h1 class="title">netsh -f で reset がみつからない</h1>
<div id="table-of-contents">
<h2>&#30446;&#27425;</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org746ed85">1. 現象</a></li>
<li><a href="#org4848e63">2. 結論</a></li>
<li><a href="#org3c9c29f">3. 環境</a></li>
<li><a href="#org6fbc09d">4. 参考</a></li>
</ul>
</div>
</div>

<div id="outline-container-org746ed85" class="outline-2">
<h2 id="org746ed85"><span class="section-number-2">1</span> 現象</h2>
<div class="outline-text-2" id="text-1">
<p>
TCP/IP の設定を切り変える方法として、古いものには以下のように書いてある。
</p>
<ol class="org-ol">
<li><p>
現在の設定を以下のようなコマンドで保存
</p>
<pre class="example">
PS C:\&gt; netsh -c interface dump &gt; test_conf.nsh
</pre></li>
<li><p>
前に設定した内容を以下のように読み込み
</p>
<pre class="example">
PS C:\&gt; netsh -f test_conf.nsh
</pre></li>
</ol>
<p>
上記をそのまま実行すると以下のようなエラーとなる。
</p>
<pre class="example">
PS C:\&gt;netsh -c interface dump &gt; test_conf.nsh
PS C:\&gt;netsh -f test_conf.nsh
次のコマンドは見つかりませんでした: ■■# (ここで■は文字化け)
</pre>
<p>
これは保存された
conf.nsh の文字コードが Unicode だからなようで、ASCII にしてやれば解決できる。
しかし、引数が間違っているだの、reset コマンドが無いだのと言われる( -u domain\user -p pass でも同じ)。
</p>
<pre class="example">
PS C:\&gt; Get-Content test_conf.nsh -encoding Unicode | Set-Content conf.nsh -encoding ASCII
PS C:\&gt; netsh -f .\conf.nsh
グローバル のリセットに成功しました。
インターフェイス のリセットに成功しました。
ユニキャスト アドレス のリセットに成功しました。
ルート のリセットに成功しました。
コンピューターを再起動してこの操作を完了してください。
ファイル名、ディレクトリ名、またはボリューム ラベルの構文が間違っています。

ファイル名、ディレクトリ名、またはボリューム ラベルの構文が間違っています。

リセットするユーザー指定の設定はありません。
次のコマンドは見つかりませんでした: reset

すべての TCP パラメーターをリセットしました。
次のコマンドは見つかりませんでした: reset
</pre>
<p>
で、再起動したけど、設定は戻らず。うん、Windouze わからない。
</p>
</div>
</div>

<div id="outline-container-org4848e63" class="outline-2">
<h2 id="org4848e63"><span class="section-number-2">2</span> 結論</h2>
<div class="outline-text-2" id="text-2">
<p>
netsh を手で直接打つか、例えば batch ファイルを作成した方が良さそう。
netsh の実行はプロンプトが返ってくるまで結構時間がかかることもあるので注意。
</p>
<pre class="example">
@echo off

REM netsh interface ip set address "設定する接続名" static IPaddress サブネットマスク ゲートウェイ 
netsh interface ip set address "ローカル エリア接続" static AAA.AAA.AAA.AAA BBB.BBB.BBB.BBB CCC.CCC.CCC.CCC
REM netsh interface ip set dns "設定する接続名" static プライマリ DNS サーバー
netsh interface ip set dns "ローカル エリア接続" static XXX.XXX.XXX.XXX
REM netsh interface ip add dns "設定する接続名" セカンダリ DNS サーバー
netsh interface ip add dns "ローカル エリア接続" XXX.XXX.XXX.XXX
</pre>

<p>
DHCP に戻す場合は以下を実行する。
</p>

<pre class="example">
@echo off

REM アドレスを DHCP に戻す場合は以下
REM netsh interface ip set address "ローカル エリア接続" dhcp
REM DNS を DHCP に戻す場合は以下
REM netsh interface ip set dns "ローカル エリア接続" dhcp
</pre>
</div>
</div>

<div id="outline-container-org3c9c29f" class="outline-2">
<h2 id="org3c9c29f"><span class="section-number-2">3</span> 環境</h2>
<div class="outline-text-2" id="text-3">
<pre class="example">
C:\Users\clothoid&gt; $PSVersionTable

Name                           Value
----                           -----
CLRVersion                     2.0.50727.5485
BuildVersion                   6.1.7601.17514
PSVersion                      2.0
WSManStackVersion              2.0
PSCompatibleVersions           {1.0, 2.0}
SerializationVersion           1.1.0.1
PSRemotingProtocolVersion      2.1
</pre>
</div>
</div>

<div id="outline-container-org6fbc09d" class="outline-2">
<h2 id="org6fbc09d"><span class="section-number-2">4</span> 参考</h2>
<div class="outline-text-2" id="text-4">
<ul class="org-ul">
<li><a href="https://msdn.microsoft.com/en-us/library/windows/desktop/aa368046">Copy a Unicode File to an ANSI File (Windows)</a></li>
<li><a href="http://oshiete.goo.ne.jp/qa/7142705.html">ネットワーク設定の切り替え - Windows 7 解決済 | 教えて！goo</a></li>
<li><a href="http://www.atmarkit.co.jp/ait/articles/0109/04/news003.html">Tech TIPS：ノート PC の TCP/IP 設定を簡単に切り替える方法（netsh コマンドを使ったネットワーク設定の高速切り替え） - ＠ IT</a></li>
<li><a href="http://www.atmarkit.co.jp/ait/articles/1002/05/news097.html">Tech TIPS：Windows の netsh コマンドで TCP/IP のパラメータを設定する - ＠ IT</a></li>
<li><a href="http://tinyurl.com/j67q4h6">メモ Windows コマンドラインで IP アドレスを変更する – Nobwak's Lair</a></li>
<li><a href="http://itpro.nikkeibp.co.jp/article/COLUMN/20060809/245476/">管理者必見！ ネットワーク・コマンド集 - netsh interface ip コマンドで IP アドレスを設定する：ITpro</a></li>
<li><a href="http://kikky.net/pc/net.html">コマンドプロンプトから IP アドレスを設定する方法 - パソコンＱ＆Ａ</a></li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">&#33879;&#32773;: clothoid</p>
<p class="date">Created: 2020-09-17 Thu 12:20</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
